////////////////////////////////////////////////////////////////////////////////

// 
////
Функция ОтправитьСМС(Телефоны, Сообщение, Транслит = Ложь, Время = "", ИД = 0, ФорматСообщения = 0, Отправитель = "", ДопПараметры = "") Экспорт 
              
    Возврат ПослатьКоманду("send", "cost=3&phones=" + URLEncode(Телефоны) + "&mes=" + URLEncode(Сообщение) + 
								   "&translit=" + ?(Транслит, 1, 0) + "&id=" + XMLСтрока(ИД) + ?(ФорматСообщения > 0, "&" + ФорматыСообщений(ФорматСообщения), "") +
								   ?(ПустаяСтрока(Отправитель), "", "&sender=" + URLEncode(Отправитель)) + 
								   ?(ПустаяСтрока(Время), "", "&time=" + URLEncode(Время)) +
								   ?(ПустаяСтрока(ДопПараметры), "", "&" + ДопПараметры));
	
КонецФункции

// 
////
Функция ПослатьКоманду(Команда, Аргументы = "") 
	
	SMSC_LOGIN1    = СокрЛП(KilBil_БонуснаяСистема.ПолучитьЗначениеКонстанты("KilBil_СМСЛогин"));  // Логин
	SMSC_PASSWORD1 = СокрЛП(KilBil_БонуснаяСистема.ПолучитьЗначениеКонстанты("KilBil_СМСПароль")); // Пароль
	
	
	Сервер 	  = "smsc.ru";
	Ресурс 	  = "/sys/" + Команда + ".php";
    Параметры = "login=" + СокрЛП(URLEncode(SMSC_LOGIN1)) + "&psw=" + СокрЛП(URLEncode(SMSC_PASSWORD1)) + "&fmt=1&charset=utf-16" + ?(Не ПустаяСтрока(Аргументы), "&" + СокрЛП(Аргументы), "");
	
	Для Сч = 1 По 3 Цикл
		Если Сч > 1 Тогда
    	    Для Сч2 = 1 По 2000 Цикл
				у = Сч2; // Небольшой таймаут
			КонецЦикла;
		КонецЕсли;
			
		Если Сч = 3 Тогда
			Сервер = "www2.smsc.ru";
		КонецЕсли;	
		
		Рез = ПрочитатьАдрес(Сервер, Ресурс, Параметры);
		
		Если НЕ ПустаяСтрока(Рез) Тогда
		    Прервать;
		КонецЕсли;	
	КонецЦикла;   
	
	Если ПустаяСтрока(Рез)  Тогда                                                   
		Рез = "," // Фиктивный ответ
	КонецЕсли;                       
	
	Возврат Строка2Список(Рез);
	
КонецФункции

// 
////
Функция ПрочитатьАдрес(Сервер, РесурсНаСервере, Параметры) 
	
	Перем Рез;
		
	Попытка
        Соединение = Новый HTTPСоединение(Сервер, , , , , Ложь);	
	Исключение
	    Сообщить("Не удалось установить соединение с сервером:" + Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		
		Возврат "";
	КонецПопытки;

	ИмяФайлаРезультата = ПолучитьИмяВременногоФайла();
	
	РесурсПараметры = РесурсНаСервере + "?" + Параметры;
	
	Если СтрДлина(РесурсПараметры) < 2000 Тогда // GET 
		Попытка
			Соединение.Получить(РесурсПараметры, ИмяФайлаРезультата);
			
			Соединение = Неопределено;
		Исключение 
			Сообщить("Не удалось получить данные с сервера", СтатусСообщения.Важное);
			
			Возврат "";
		КонецПопытки;		
	Иначе // POST	
		//Создаём файл отправки - содержимое POST-запроса. 
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла();
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI, Символы.ПС, Ложь);
		ФайлОтправки.ЗаписатьСтроку(Параметры); 
		ФайлОтправки.Закрыть(); 

		//Формируем заголовок POST-запроса.
	    ЗаголовокHTTP = Новый Соответствие();
	    ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
		
		ФайлОтправки = Новый Файл(ИмяФайлаОтправки); 
	    РазмерФайлаОтправки = XMLСтрока(ФайлОтправки.Размер()); 
		
		ЗаголовокHTTP.Вставить("Content-Length", Строка(РазмерФайлаОтправки)); 

		Попытка
	 		Соединение.ОтправитьДляОбработки(ИмяФайлаОтправки, РесурсНаСервере, ИмяФайлаРезультата, ЗаголовокHTTP);
			
			Соединение = Неопределено;
		Исключение 
			Сообщить("Не удалось получить данные с сервера:" + Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
			
			Возврат "";
		КонецПопытки;	
	КонецЕсли;	
		
	ФайлРезультата = Новый ЧтениеТекста(ИмяФайлаРезультата);
	Рез = ФайлРезультата.ПрочитатьСтроку();
	
	Возврат Рез;
	
КонецФункции

// 
////
Функция URLEncode(Стр1) 
             
	Рез = ""; 
	Стр = СокрЛП(Стр1);
	
	Для Сч = 1 По СтрДлина(Стр) Цикл
		Символ = Сред(Стр, Сч, 1);
		КС 	   = КодСимвола(Символ);
		Рез    = Рез + "%"+ Hex(Цел(КС / 256)) + "%"+ Hex(КС % 256);
	КонецЦикла;
 
	Возврат Рез;
	
КонецФункции

// 
////
функция ФорматыСообщений(ФорматСообщения) 
	
	Возврат ?(ФорматСообщения, "flash=1", "");
	
конецфункции

// 
////
Функция Строка2Список(Стр) 
	
	Перем Рез;
	    
	Рез = Новый СписокЗначений;
	Сч = 1;
	
	Для Сч = 1 По 4 Цикл
		Поз = Найти(Стр, ","); 
		
		Если Поз = 0 Тогда
		    Рез.Добавить(Стр);
			
			Прервать;                 
		Иначе	
			Рез.Добавить(Лев(Стр, Поз - 1));
		КонецЕсли;	 
		
		Стр = Сред(Стр, Поз + 1, СтрДлина(Стр) - Поз);
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

// 
////
Функция Hex(КС) 
	
	Hex = Новый Массив(16);
	Hex[0]  = "0";
	Hex[1]  = "1";
	Hex[2]  = "2";
	Hex[3]  = "3";
	Hex[4]  = "4";
	Hex[5]  = "5";
	Hex[6]  = "6";
	Hex[7]  = "7";
	Hex[8]  = "8";
	Hex[9]  = "9";
	Hex[10] = "A";
	Hex[11] = "B";
	Hex[12] = "C";
	Hex[13] = "D";
	Hex[14] = "E";
	Hex[15] = "F";	
	
	Возврат Hex[Цел(КС / 16)] + Hex[Цел(КС % 16)];
	
КонецФункции